const translation = {
    // navigation
    'nav-projects': 'Проєкти',
    'nav-about': 'Про мене',
    'nav-contacts': 'Контакти',
    'nav-skills': 'Навички',

    // home page
    'welcome': 'Ласкаво прошу до мого портфоліо',
    'who-im': "Я Юрій Леонтеко",
    'my-position': 'Full Stack розробник ',


    // about section
    'about-title': 'Про мене',
    'about-bio-paragraph-one': 'Привіт! Я Юрій, Full Stack розробник, яким все життя керує захоплення технологіями, спортом та творчістю. 💻🚀',
    'about-bio-paragraph-two': 'У юності я присвятив себе професійному велоспорту, в якому досяг вагомих результатів.',
    'about-bio-paragraph-three': 'Однак моя непохитна пристрасть до технологій і гострий інтерес до веб- розробки повернули мене до динамічного світу ІТ.',
    'about-bio-paragraph-four': 'Вирішення складних проблем є моєю природною сильною стороною, відточеною роками досвіду в спорті.',
    'about-bio-paragraph-five': 'Давайте об’єднаємо зусилля та дослідимо, як мій різноманітний досвід у поєднанні з невпинною пристрастю до розвитку може забезпечити успіх ваших проектів! 🌐🚀',
    'about-skills':
        'Ось деякі з речі, в яких я добре розуміюся: ',

    // projects page 
    'projects-title': 'Мої проєкти',
    'web-studio-description':
        'Двосторінковий веб-сайт компанії з адаптивною версткою.',
    'movies-description':
        'Веб-програма React для кількох пристроїв для пошуку фільмів. Вона дозволяє шукати фільми за ключовими словами та відображає список відповідних фільмів.',
    'phonebook-description':
        'Веб-додаток, вбудований у React, із авторизацією для керування вашою телефонною книгою. Він дозволяє додавати, переглядати, редагувати та видаляти контакти.',
    'ice-cream-description':
        'Сайт компанії Ice Cream. Охайний та смачний дизайн, адаптивна верстка.',


    // contacts page
    'contacts-title': 'Контакти',
    'name': 'Ім\'я',
    'name-placeholder': 'Ваше Ім\'я',
    'email': 'Електронна пошта',
    'message': 'Повідомлення',
    'welcome-placeholder': 'Привіт...',
    'is-error-message': 'Please fill in all fields and provide a valid email address.',
    'is-sent-message': 'Message sent successfully!',
    'contacts-action-btn': 'Надіслати повідомлення',
    'my-name': 'Юрій Леонтенко',
    'my-location': 'Краків, Польща',
    'contacts-action-email': 'Надіслати електронний лист',
    'contacts-action-resume': 'Завантажити резюме',
}

export default translation;
